## Pandas

### Load pandas and print the version

In [2]:
import pandas as pd
print(pd.__version__)

1.1.5

### Create a series from list, numpy array and dictionary

In [3]:
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))


ser1 = pd.Series(mylist)
print('Series from list')
print(ser1.head(5))
ser2 = pd.Series(myarr)
print('series from numpy array \n', ser2.head(6))
ser3 = pd.Series(mydict)
print('Series from dictionary \n', ser3.head())

Series from list
0    a
1    b
2    c
3    e
4    d
dtype: object
series from numpy array
 0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64
Series from dictionary
 a    0
b    1
c    2
e    3
d    4
dtype: int64

### Unique elements in two series

In [15]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])


ser_u = pd.Series(np.union1d(ser1, ser2))  # union
ser_i = pd.Series(np.intersect1d(ser1, ser2))  # intersect
ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

### Create a dataframe

In [10]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
df.head()

<class 'dict'>

   col1  col2
0     1     3
1     2     4

In [50]:
#Exercise
# create a dataframe fruits_df from nested list

data = [['apple', 120], ['Orange', 80], ['Guava', 90], ['chikku', 100]]
fruits_df = pd.DataFrame(data)
fruits_df.columns = ['fruits', 'price']
fruits_df.head()

   fruits  price
0   apple    120
1  Orange     80
2   Guava     90
3  chikku    100

### Read data from csv

In [51]:
salary_df = pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")
# read_csv has many arguments to control and parse data while reading the file check out the doc  

# print a sample of the data set 
salary_df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [ ]:
#Exercise
#try print first 10 20 lines using head function and last n lines

In [53]:
salary_df.dtypes 
# prints data types of all the columns

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [54]:
salary_df['salary'].dtype

dtype('int64')

In [55]:
salary_df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [57]:
salary_df.phd.describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [59]:
# find different types of rank and thier counts
salary_df['rank'].value_counts()

Prof         46
AsstProf     19
AssocProf    13
Name: rank, dtype: int64

In [65]:
# find average salary of each rank
temp = salary_df.groupby('rank')[['salary']].mean()
temp.reset_index()

        rank         salary
0  AssocProf   91786.230769
1   AsstProf   81362.789474
2       Prof  123624.804348

In [69]:
# find average salary of each rank
temp = salary_df.groupby(['rank','sex'])[['salary']].mean()
temp.reset_index()

        rank     sex         salary
0  AssocProf  Female   88512.800000
1  AssocProf    Male  102697.666667
2   AsstProf  Female   78049.909091
3   AsstProf    Male   85918.000000
4       Prof  Female  121967.611111
5       Prof    Male  124690.142857

### slicing and dicing dataframes

In [70]:
# try below different methods of slicing dataframe one at a time 
# selecting columns
salary_df1 = salary_df['salary']
#salary_df1 = salary_df[['rank','salary' ]]

# selecting rows
#salary_df1 = salary_df[10:20]

# select rows by their labels
#salary_df1 = salary_df.loc[10:20,['rank','sex','salary']]
#salary_df1 = salary_df.iloc[10:20,[0, 3, 4, 5]]
print(type(salary_df1))
salary_df1.head(10)

<class 'pandas.core.series.Series'>

0    186960
1     93000
2    110515
3    131205
4    104800
5    122400
6     81285
7    126300
8     94350
9     57800
Name: salary, dtype: int64

### data aggregation

In [61]:
salary_df[['phd','salary']].agg(['min','max','mean'])

            phd         salary
min    1.000000   57800.000000
max   56.000000  186960.000000
mean  19.705128  108023.782051

In [5]:
salary_df.agg({"rank":['sum', 'min'], 
              "phd":['max', 'min'], 
              "service":['min', 'sum'],  
              "salary":['sum']})

,rank,phd,service,salary
max,NaN,56.0,NaN,NaN
min,AssocProf,1.0,0.0,NaN
sum,ProfProfProfProfProfProfAssocProfProfProfProfP...,NaN,1174.0,8425855.0

### Read data from local file system

In [71]:
### Missing data

flight_df = pd.read_csv("flights.csv")
flight_df.head()

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
0,2013,1,1,517.0,2.0,830.0,11.0,UA,N14228,1545,EWR,IAH,227.0,1400,5.0,17.0
1,2013,1,1,533.0,4.0,850.0,20.0,UA,N24211,1714,LGA,IAH,227.0,1416,5.0,33.0
2,2013,1,1,542.0,2.0,923.0,33.0,AA,N619AA,1141,JFK,MIA,160.0,1089,5.0,42.0
3,2013,1,1,554.0,-6.0,812.0,-25.0,DL,N668DN,461,LGA,ATL,116.0,762,5.0,54.0
4,2013,1,1,554.0,-4.0,740.0,12.0,UA,N39463,1696,EWR,ORD,150.0,719,5.0,54.0

In [24]:
flight_df.shape

(160754, 16)

In [22]:
nan_df = flight_df[flight_df.isnull().any(axis=1)]
# try isnull() in console and evaluate the output 
nan_df.head()

,year,month,day,dep_time,dep_delay,arr_time,arr_delay,carrier,tailnum,flight,origin,dest,air_time,distance,hour,minute
330,2013,1,1,1807.0,29.0,2251.0,NaN,UA,N31412,1228,EWR,SAN,NaN,2425,18.0,7.0
403,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EHAA,791,LGA,DFW,NaN,1389,NaN,NaN
404,2013,1,1,NaN,NaN,NaN,NaN,AA,N3EVAA,1925,LGA,MIA,NaN,1096,NaN,NaN
855,2013,1,2,2145.0,16.0,NaN,NaN,UA,N12221,1299,EWR,RSW,NaN,1068,21.0,45.0
858,2013,1,2,NaN,NaN,NaN,NaN,AA,NaN,133,JFK,LAX,NaN,2475,NaN,NaN

In [25]:
clean_df = flight_df.fillna(0)
clean_df[clean_df.isnull().any(axis=1)].shape

(0, 16)

In [26]:
na_dropped = flight_df.dropna()
na_dropped.shape

(157927, 16)

In [75]:
flight_df[['year','month','day']].dtypes

year     int64
month    int64
day      int64
dtype: object

In [39]:
flight_df['Date'] = flight_df.year.astype(str) + '-' + flight_df.month.astype(str) + '-' + flight_df.day.astype(str)

In [40]:
flight_df.Date.head()

0    2013-1-1
1    2013-1-1
2    2013-1-1
3    2013-1-1
4    2013-1-1
Name: Date, dtype: object

## sqlite

### creating a sqlite db and connecting to it

In [30]:
import sqlite3
from sqlite3 import Error
 
db_file = "pytutorial.db"

conn = sqlite3.connect(db_file)
print(sqlite3.version)

2.6.0

In [32]:
clean_df.to_sql('flights', if_exists= 'append', index=False, con=conn)

In [44]:
pd.read_sql_query("SELECT * FROM flights limit 10", conn)

ProgrammingError: Cannot operate on a closed database.

In [43]:
conn.close()